Repository: 84000/data-translation-memory
Catalog: Toh_357-The_Prophecy_on_Mount_Gosrnga-v.2.tmx
Source language: bo
Languages: en

source: དེས་ན་ཡུལ་འདིར་ཕྱོགས་དང་ཕྱོགས་མཚམས་ནས་ཚོང་དཔོན་ཆེན་པོ་རྣམས་འོང་བར་འགྱུར་ཞིང་གནོད་པ་རྣམས་ཀྱང་ཞི་བར་འགྱུར་རོ། །
en: As a result, wealthy merchants from other lands in all directions will come here and all negative forces will be pacified.

source: གཞན་ཡང་ཡུལ་འདིར་དེ་བཞིན་གཤེགས་པའི་གཟུགས་བརྙན་ཉིས་བརྒྱ་རྩ་བརྒྱད་འོད་སྲུང་གི་མཆོད་རྟེན་དང་བཅས་པར་འབྱུང་བར་འགྱུར་ཏེ།
en: Two hundred and eight images of the thus-gone ones, together with the Kāśyapa stūpa, will appear in this land.

source: དེ་དག་ཐམས་ཅད་ཀྱང་ཆོ་འཕྲུལ་ཆེན་པོ་སྟོན་ཅིང་སེམས་ཅན་རྣམས་ཀྱི་སྡིག་པ་ཆེན་པོ་ཡོངས་སུ་སྦྱོང་བ་དང་། གནོད་པ་སེལ་བར་མཛད་པར་འགྱུར་རོ། །
en: Each of them will display great miracles, purify the grave misdeeds of sentient beings, and dispel negative forces.

source: ཡུལ་འདིར་གནོད་པ་དང་། འཇིགས་པ་དང་། སྐྲག་པ་འགའ་ཞིག་བྱུང་ན་
en: “If it so happens that some negative forces and causes of fear and terror do appear in this land,

source: ཡུལ་འདིའི་ཆེད་དུ་ཕྱོགས་ལྔར་སྦྱོར་བ་བྱས་ཏེ།
en: people should resort to the five regions for the sake of the country.

source: རྒྱལ་པོ་དང་བློན་པོ་རྣམས་ཡུལ་འཛིན་པ་གང་ཞིག་འཇིགས་པ་དང་བྲལ་བར་བྱ་བའི་ཕྱིར་བདེ་བར་གཤེགས་པའི་བསྟན་པ་ལས་བསོད་ནམས་བསྐྱེད་པར་འདོད་ན་
en: If the king, or the ministers and governors of the land wish to create merit through the Well-Gone One’s teachings in order to free the land from fear,

source: གཙུག་ལག་ཁང་ཚར་མ་ཞེས་བྱ་བར་བསོད་ནམས་བྱའོ། །
en: they should create merit at Tsarma Temple.

source: ཡུལ་འདིའི་མི་རྣམས་ཀྱི་དད་པ་དང་། ཡང་དག་པའི་ལྟ་བ་ནི་དང་པོའི་གཙུག་ལག་ཁང་དེ་ནས་སྐྱེ་བར་འགྱུར་རོ། །
en: Because the faith and correct view of the people of this land are born in that temple.

source: ནམ་ཞིག་ལིའི་རྒྱལ་པོ་དང་། བློན་པོ་དང་། ཡུལ་འཛིན་པ་རྣམས་ལ་གནོད་པ་རྣམ་པ་སྣ་ཚོགས་ཤིག་བྱུང་ན།
en: If at some point the king, or the ministers and governors of Khotan are faced with many kinds of negative forces,

source: རི་གླང་རུ་ལ་སྔོན་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གང་ན་བཞུགས་བཞུགས་པའི་གཞི་དེ་ལ་བསྐོར་བར་བྱའོ། །
en: they should circumambulate Mount Gośṛṅga—that place where in the past the perfect buddhas were seated.

source: ཡུལ་འདིའི་སེམས་ཅན་རྣམས་ལས་མི་དགེ་བ་འཆགས་པར་འདོད་ན་
en: If the people of this land wish to purify their negative karma,

source: མཆོད་རྟེན་གོ་མ་ས་ལ་གན་དའི་དྲུང་དུ་བཤགས་པར་བྱའོ། །
en: they should make confessions before the Gomasalaganda stūpa.

source: མཆོད་རྟེན་དེ་ནི་སངས་རྒྱས་བཞུགས་པ་བཞིན་དུ་
en: Because this stūpa is like the buddha in person;

source: གང་དག་གིས་བསྐོར་བའམ། མེ་ཏོག་གམ། བདུག་པའམ། དབྱངས་སམ། རོལ་མོའི་སྒྲས་མཆོད་པ་བྱས་ན་
en: whoever circumambulates it, or venerates it with flowers, incense, song, or music

source: དེའི་མཚམས་མེད་པ་ལྔ་ཡང་ཉམས་དམས་པར་འགྱུར་ནགཞན་ལྟ་སྨོས་ཀྱང་ཅི་དགོས།
en: can diminish even the five inexpiable deeds, not to mention other negative acts.

source: ཡུལ་འདིའི་རྒྱལ་པོ་དང་། བློན་པོ་དང་། ཡུལ་འཛིན་པ་གང་ཞིག་བརྟུལ་ཞུགས་ཆེན་པོའི་སྡོམ་པ་ལེན་པར་འདོད་པ་དེས་
en: If the king, ministers, and governors of this land wish to take a vow of great discipline,

source: !རི་གླང་རུ་ལ་གང་ན་དེ་བཞིན་གཤེགས་པའི་གཟུགས་བརྙན་པི་སེ་ཞེས་བྱ་བ་དང་། འོད་སྲུང་གི་མཆོད་རྟེན་ཡོད་པ་དེའི་དགེ་འདུན་ལས་མནོད་པར་བྱའོ། །
en: they should take such a vow from the saṅgha at Mount Gośṛṅga, where the Thus-Gone One’s image called Chisé and the Kāśyapa stūpa are.

source: ཡུལ་འདིར་ཆོས་ཀྱི་སྤྱོད་པ་ཡོངས་སུ་རྫོགས་པ་དང་། ཚུལ་ཁྲིམས་ཡོངས་སུ་དག་པ་ནི་དེ་ནས་འབྱུང་བར་འགྱུར་བའི་ཕྱིར་རོ། །
en: Because in this land, perfect Dharma conduct and impeccable discipline will arise there.

source: ཡུལ་འདིའི་མི་ལ་ལ་ཞིག་ཆད་པ་ཆེན་པོ་ཞིག་ལ་ཐུག་ན་
en: If some people in this land find themselves facing grave privation,

source: དེས་རི་གླང་རུ་ལ་གནས་པའི་འཕགས་པའི་དགེ་འདུན་ལ་སྐྱབས་སུ་འགྲོ་བར་བྱས་ཏེ།
en: they should go for refuge to the noble saṅgha living at Mount Gośṛṅga.

source: དེས་ན་ཆད་པ་དེ་ལས་ཐར་བར་འགྱུར་རོ། །
en: Thereby they will be freed from their privation.

source: གནས་དེ་ན་ཐར་པ་ཐོབ་པ་སྟོང་ཕྲག་དུ་མ་ཕྱི་མའི་མཐའི་བར་དུ་གནས་ཤིང་མི་སྟོངས་པའི་ཕྱིར་རོ། །
en: Because many thousands of people will gain liberation in that locale and it will remain until the end of time and not disappear.

source: !རྒྱུ་དེས་ན་རི་གླང་རུ་དང་མཆོད་རྟེན་གོ་མ་ས་ལ་གན་ད་ཡུལ་དང་བཅས་པ་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་ཆང་བྱུ་ཡིན་ནོ། །
en: For these reasons, Mount Gośṛṅga, the Gomasalaganda stūpa, and its land are the site where the thus-gone ones assemble.”

source: དེ་ནས་དེའི་ཚེ་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་དག་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཉི་ཁྲི་ལྷགས་ནས།
en: At that moment, twenty thousand bodhisattvas arrived from the buddha realms in the ten directions.

source: བཅོམ་ལྡན་འདས་གང་ན་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ་དབྱངས་གཅིག་ཏུ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: They bowed toward the Blessed One with palms joined, and in a single voice said,

source: བཅོམ་ལྡན་འདས་བདག་ཅག་རྣམས་ཀྱིས་ཀྱང་ཐབས་སྣ་ཚོགས་ཀྱིས་དེ་བཞིན་གཤེགས་པའི་སྤྱོད་ཡུལ་དང་ཡུལ་འདི་ཡོངས་སུ་བསྐྱང་བར་བགྱི།
en: “Blessed One, we too will sustain and guard this land and the Thus-Gone One’s domain of activities here in a variety of ways.

source: བསྲུང་བར་བགྱི་ཞིང་ཇི་སྲིད་དུ་བདེ་བར་གཤེགས་པའི་བསྟན་པ་དང་། དཀོན་མཆོག་གསུམ་ལ་གནས་ཤིང་།
en: For as long as the Well-Gone One’s teachings and the Three Jewels remain, and

source: རྒྱལ་པོ་དང་བློན་པོ་ལ་སོགས་པ་མིའི་ཚུལ་ཁྲིམས་དང་ལྡན་པ་དད་པ་ཅན་དང་། ཡུལ་ཆོས་དང་འཐུན་པར་བགྱིད་པ་མཆིས་པ་དེ་སྲིད་དུ་ཡོངས་སུ་མི་གཏང་ཞིང་
en: for as long as the kings, ministers, and others maintain discipline, have faith, and rule the land in accord with the Dharma, we will not forsake this land.

source: ཡུལ་འདིར་དུས་དུས་སྤྱོད་ལམ་དང་ཆ་ལུགས་ཅི་དང་ཇི་ལྟ་བུས་སེམས་ཅན་མང་པོའི་བསོད་ནམས་ཆེན་པོ་ཡོངས་སུ་སྨིན་པར་འགྱུར་བ་དང་། སངས་རྒྱས་ཉིད་དུ་སེམས་བསྐྱེད་པར་འགྱུར་བ་དང་། བསམ་གཏན་དང་། ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་འཇུག་པར་འགྱུར་བ་དང་། སངས་རྒྱས་ཉིད་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་བ་
en: We will continue to come here and, assuming whatever behavior and attire may be appropriate, we will fully ripen vast merit in a great number of beings, generate within them the wish to attain buddhahood, help them rest in concentration and absorption, and establish them irreversibly in buddhahood.

source: དེ་ལྟ་བུའི་སྐྱེ་བ་བླང་བའི་སླད་དུ་ཁ་ཅིག་གིས་ནི་རྒྱལ་རིགས་ཡོངས་སུ་གཟུང་བར་བགྱི།
en: In order to take these kinds of rebirth, some will take birth in the royal line,

source: ཁ་ཅིག་གིས་ནི་རབ་ཏུ་བྱུང་བ་དང་། ཁྱིམ་པ་གཞན་གྱི་ཆ་ལུགས་ཡོངས་སུ་གཟུང་བར་བགྱིའོ། །
en: some will take ordination, while still others will assume the attire of householders.”

source: རིགས་ཀྱི་བུ་ལེགས་སོ་ལེགས་སོ། །
en: “Noble children, excellent! Excellent!

source: རིགས་ཀྱི་བུ་ཁྱེད་རྣམས་ཀྱིས་འདི་ལྟར་བསྐལ་པ་བཟང་པོའི་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་སྤྱོད་ཡུལ་དང་ཡུལ་འདི་གང་དུ་སེམས་ཅན་རྣམས་སངས་རྒྱས་ཉིད་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་བ་དེ་ལྟ་བུར་ཆུ་གང་ཐོབ་ཤིག །
en: Noble children, may you gain the strength to do this—to ensure that all sentient beings within this land, the domain of all the buddhas of the Excellent Eon, proceed irreversibly to buddhahood!”

source: ཡང་དེའི་ཚེ་ལྷ་རྣམ་ཐོས་ཀྱི་བུ་ཞེས་བྱ་བ་དང་། མི་ཕམ་པ་ཞེས་བྱ་བ་ལ་སོགས་པ་ལྷ་ཐམས་ཅད་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: The gods Vaiśravaṇa and Ajita, together with all of the other gods present, then said to the Blessed One,

source: བཅོམ་ལྡན་འདས་ད་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱིས་ཡུལ་འདི་བསྲུང་བའི་སླད་དུ་མཐུ་བསྟངས་པ་དང་།
en: “Blessed One, please imbue these bodhisattva great beings with strength so that they may guard this land.

source: བཅོམ་ལྡན་འདས་ཀྱིས་བྱིན་གྱིས་བརླབས་པ་དང་མཐུས་བདག་ཅག་གིས་ཀྱང་དེ་བཞིན་གཤེགས་པའི་སྤྱོད་ཡུལ་དང་། བྱིན་གྱིས་བརླབས་བརླབས་པའི་ཡུལ་འདི་ཀུན་ཏུ་བསྲུང་ཞིང་
en: Blessed One, through your blessings and power we too will guard the thus-gone ones’ domain and this land that has been blessed.

source: ཡལ་བར་མི་གཏང་བར་བགྱི་བའི་སླད་དུ་བརྩོན་འགྲུས་ཆེན་པོའི་ཤུགས་ཀྱིས་འབད་པར་འཚལ་ལོ། །
en: We will not let it disappear. We will exert ourselves in this with great perseverance.

source: གལ་ཏེ་ཡུལ་འདིར་གྲུ་གུ་ལ་སོགས་པ་གཏུམ་པོ་དད་པ་མ་མཆིས་པ་རྣམས་དང་། ཧོར་དང་། སུམ་པའི་དམག་དག་མཆི་བར་འགྱུར་ན།
en: If wild people, such as the faithless Drugu, or if armies from Hor and Sumpa come here,

source: དེ་དག་ཕན་ཚུན་ནང་འཁྲུག་འབྱུང་བ་དང་། དེ་དག་གི་འཁོར་ནང་མི་འཐུན་པར་འགྱུར་བ་དང་། འགུམ་པར་འགྱུར་བར་བགྱིའོ། །
en: we will cause infighting between them, incite discord within their own troops, and make them perish.

source: ཡང་ན་དེ་དག་ཅི་ནས་ཀྱང་འདིར་མཆི་ཞིང་དེ་བཞིན་གཤེགས་པའི་བསྟན་པ་འཇིག་མི་ནུས་པར་བགྱི་བའི་སླད་དུ་
en: Alternatively, to ensure that they do not come here under any circumstances, so that they are unable to destroy the Thus-Gone One’s teachings,

source: གཞན་གྱི་དབང་དུ་འགྱུར་བར་བགྱིའོ། །
en: we will cause them to fall under the control of others.

source: གལ་ཏེ་རྒྱའི་དམག་དག་མཆིས་པར་གྱུར་ན་དེ་དག་གི་སེམས་དད་པར་བགྱི་ཞིང་། སླར་ཡུལ་འདི་ལ་ཕན་འདོགས་པ་དང་ཕྱིས་ཡུལ་འདིར་བསོད་ནམས་བྱ་བའི་དངོས་པོ་དགེ་བ་རྒྱ་ཆེན་པོ་བགྱིད་དུ་སྩལ་ཏོ། །
en: If Chinese armies come here, we will inspire them with faith, and ensure that they bring benefit to this land and in the future create great virtue through performing meritorious deeds here.

source: ནམ་ཞིག་ཡུལ་འདིའི་སེམས་ཅན་རྣམས་ལ་གནོད་པ་བགྱིད་པ་དེའི་ཚེ་ན་
en: When at some point they inflict harm upon the beings of this land,

source: ཡང་ཕྱིར་དད་པར་བགྱི་ཞིང་། མདོ་འདི་ཡང་ཁོང་དུ་ཆུད་པར་བགྱིད་དུ་སྩལ་ཏོ། །
en: we will once more engender faith in them and ensure that they comprehend this discourse.

source: གང་གི་ཚེ་དེ་དག་མ་འོངས་པའི་དཀོན་མཆོག་གསུམ་གྱི་ཡོ་བྱད་ལ་དབང་འཚལ་ཞིང་། མངའ་འཕྲོག་པ་དང་། སེམས་ཅན་བསོད་ནམས་དང་ལྡན་པ་རྣམས་ལ་འཚེ་བ་
en: When in the future they seek control over the objects of the Three Jewels, seize power, and cause harm to meritorious beings,

source: དེའི་ཚེ་ནི་བདག་ཅག་གི་འཁོར་གནོད་སྦྱིན་དད་པ་ཅན་དང་དད་པ་མ་མཆིས་པ་དུ་མ་ཞིག་དབང་བསྐུར་ཏེ་བཀྱེ་ནས་
en: at that time we will empower and dispatch many of the yakṣas in our retinue—those who have faith as well as some who lack faith—

source: ཡུལ་དེར་ཅི་ནས་ཀྱང་ཡུན་རིང་ཞིག་གི་བར་དུ་རྒུད་པར་བགྱི་ཞིང་ཡུལ་འདི་འཇིག་མི་ནུས་པར་བགྱི་བའི་སླད་དུ་མུ་གེ་དང་ནད་དང་ཕ་རོལ་གྱི་དམག་མཆི་བར་བགྱིད་དུ་སྩལ་ཏོ། །
en: [at that time we will empower and dispatch many of the yakṣas in our retinue—those who have faith as well as some who lack faith—]to ensure that prolonged decline occurs in that country, and that they experience famine, disease, and attacks from foreign armies that make them unable to destroy this land.

source: ལི་ཡུལ་གྱི་ནོར་རྫས་དེ་དག་གིས་འཚལ་བ་རྣམས་ཀྱང་བཀྲ་མི་ཤིས་པར་བགྱི་ཞིང་
en: Even if they should plunder any wealth from the land of Khotan, we shall ensure that it brings them bad luck.

source: གང་དང་གང་དུ་ཕྱིན་པའི་ཡུལ་དེ་ཐམས་ཅད་དུ་ཡང་སྨན་ཡོན་མི་ཐོགས་ཤིང་འཁྲུག་པར་བགྱིའོ། །
en: Whichever country they visit, we will ensure that they are met not with hospitality but with rebellion.

source: དེ་དག་གི་ཡུལ་འཛིན་པ་དང་དམག་དཔོན་ཡང་རྒུད་པར་བགྱིའོ། །
en: We will ensure that their governors and military leaders face decline.

source: བོད་ཀྱི་དམག་རྣམས་ལ་ཡང་དེ་བཞིན་དུ་རིག་པར་བགྱི་སྟེ།
en: It should be known that it will be the same for the Tibetan army.

source: དེ་གང་གི་ཚེ་དེ་དག་ཆོས་དང་འཐུན་པར་ཡུལ་འདི་འཛིན་ཅིང་སྲུང་ན་ནི་བདག་ཅག་རྣམས་ཀྱིས་ཀྱང་དེ་དག་ཡོངས་སུ་བསྐྱང་ཞིང་རྒྱལ་བར་འགྱུར་བར་བགྱིའོ། །
en: When the land is ruled and protected in harmony with the Dharma, we will nurture it and make it victorious.

source: ནམ་ཞིག་དེ་དག་བདེ་བར་གཤེགས་པའི་བསྟན་པ་འཇིག་པ་དང་ཡུལ་གྱི་མི་ལ་གནོད་པར་བགྱིད་པ་དེའི་ཚེ་ནི་དམག་རྣམས་ནང་འཁྲུག་འབྱུང་བ་དང་། དམག་གི་དཔོན་པོ་ཡང་ཆེ་ཐང་དུ་རྒུད་པར་བགྱི་སྟེ
en: However, when the Well-Gone One’s teaching is destroyed and the people of the land are harmed, we will ensure that the army will be riven by internal strife and that the military leaders will suffer a great decline.

source: རྒྱས་པར་ནི་སྔ་མ་བཞིན་ནོ། །
en: As for the details, it will occur just as already explained.

source: མ་འོངས་པའི་དུས་ན་ཡུལ་འདིའི་རྒྱལ་པོ་དང་བློན་པོ་སེམས་གྱ་གྱུ་ཅན།
en: “In the future, there will be some kings and ministers of this land who will be full of deceit.

source: བསོད་ནམས་ཆུང་བ་དང་། དད་པ་མེད་པ།
en: They will have little merit and no faith.

source: !དཀོན་མཆོག་གསུམ་གྱི་དཀོར་ལ་འཇོལ་ཉག་ཏུ་རློམ་ཞིང་།
en: They will lust insatiably after the property of the Three Jewels.

source: ཡུལ་གྱི་རྩིས་མགོ་དང་འགལ་བར་བགྱིད་པ།
en: They will contravene the rules of the country.

source: ནོར་རྫས་མ་བརྟགས་པས་གོ་འཕང་ཚོལ་ལ་
en: They will pursue grandeur without paying attention to their wealth, and

source: སེམས་ཅན་བསོད་ནམས་དང་ལྡན་པ་རྣམས་ལ་སུན་འབྱིན་ཏུ་རྒོལ་བ།
en: they will oppose those with merit by discrediting them.

source: ངོ་ཚ་མེད་པ། མངན་དུས་ཅན། འདོད་པའི་ཡོན་ཏན་གྱིས་ངོམས་མི་མྱོང་བ།
en: They will be shameless, flawed, and insatiable when it comes to sensual pleasures.

source: རབ་ཏུ་འབྱུང་བ་དག་གིས་སེམས་སྐྱོ་བ་ལ་ལ་དག་འབྱུང་བར་འགྱུར་ན་
en: They will feel offended by those who have gone forth.

source: དེ་དག་ནི་བདག་ཅག་གིས་ཀྱང་ཡུལ་འདི་ནས་དབྱུང་ཞིང་ཡུལ་ངན་པ་གཞན་དང་གཞན་དག་ཏུ་སྤྱུགས་པར་བགྱི་སྟེ
en: When these things happen we will drive them out from this land and expel them to other inferior lands.

source: ཚུལ་དེ་ལྟ་བུས་ཡུལ་འདི་ཡོངས་སུ་བསྐྱང་བ་དང་བསྲུང་བར་བགྱིའོ། །
en: In these ways, we will sustain and guard this land.

source: བཅོམ་ལྡན་འདས་སླད་མ་རྩོད་པའི་དུས་ན་ཡུལ་འདི་གཞིག་པར་བརྩོན་པའི་སེམས་ཅན་བདུད་ཀྱི་ཕྱོགས་སྡིག་པ་བགྱིད་པ།
en: “Blessed One, in the future, during the age of conflict, there will appear demonic beings who will seek to destroy this land.

source: མཐུ་སྟོབས་དང་ལྡན་པ།
en: [“Blessed One, in the future, during the age of conflict, there will appear demonic beings who will seek to destroy this land.] These evildoers will be powerful.

source: ཡུལ་དག་ཏུ་སེམས་ཅན་རྣམས་ཀྱི་དད་པ་ཟློག་པར་བགྱིད་པ།
en: They will cause beings throughout the lands to lose their faith.

source: སེམས་གདུག་ཅིང་བརླང་བའི་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། སྲིན་པོ་དུ་མ་ཞིག་འབྱུང་བར་འགྱུར་ལ།
en: There will be many of them—gods, nāgas, yakṣas, and rākṣasas—all with wicked and savage minds.

source: དེ་དག་ཀྱང་བདག་ཅག་གི་དབང་དུ་མི་འགྱུར་ན་
en: If we are unable to bring these beings under our control,

source: དེ་ལ་བདག་ཅག་གིས་ཐབས་ཇི་ལྟར་འཚལ།
en: to what means should we turn?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་ཁྱེད་ཡིད་སྐྱོ་བར་མ་བྱེད་ཅིག །
en: “Noble children,” the Blessed One replied, “do not be disheartened.

source: གླིང་བཞི་པ་འདི་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དང་། ལྷ་མཐུ་སྟོབས་ཆེ་བ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་ས་ཐོབ་པ་དུ་མ་ཞིག་གནས་པ་
en: In this world of the four continents there live many bodhisattvas, mighty gods, nāgas, and yakṣas who have attained the levels.

source: དེ་དག་ལ་སེམས་འཇམ་པོས་མཆོད་པ་ཆེན་པོ་བྱས་ཏེ
en: Make elaborate offerings to them with a gentle state of mind, and

source: མཆོད་རྟེན་གོ་མ་ས་ལ་གན་ད་དང་། གཙུག་ལག་ཁང་ཚར་མ་ལ་སོགས་པ་ཡུལ་བྱིན་གྱིས་བརླབས་བརླབས་པ་རྣམས་སུ་ཐེག་པ་ཆེན་པོའི་སྡེ་སྣོད་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། འདུས་པ་ཆེན་པོ་དང་། སངས་རྒྱས་ཕལ་པོ་ཆེ་དང་། དཀོན་མཆོག་བརྩེགས་པ་ལ་སོགས་པ་ཤིན་དུ་རྒྱས་པའི་སྡེ་མང་པོ་ལྷོགས་ཤིག་དང་།
en: at blessed places, such as the Gomasalaganda stūpa and the Tsarma Temple, you should resound a great number of the extensive Great Vehicle discourses, such as the Perfection of Wisdom, the Great Assembly, the Ornaments of the Buddhas, and the Heap of Jewels.

source: ཡུལ་སོ་སོ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ས་བཅུ་པ་ལ་སོགས་པ་དང་། མཐུ་སྟོབས་ཆེ་བའི་སེམས་ཅན་དེ་དག་ཡུལ་འདིར་འོངས་ནས་
en: Bodhisattvas on the ten levels—such beings with power and might— from other lands will then come to this land.

source: ཆོས་ཀྱི་རོ་མནོས་ཤིང་དུས་གསུམ་དུ་གཏོགས་པའི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་དམ་ཚིག་ལས་མི་འགལ་བར་བྱེད།
en: Here they will let beings savor the taste of the Dharma and ensure they do not transgress the commitments of the thus-gone ones of the three times.

source: བསྐལ་པ་བཟང་པོའི་སངས་རྒྱས་རྣམས་ཀྱི་སྤྱོད་ཡུལ་དང་ཡུལ་ཡང་སྲུང་བར་བྱེད།
en: They will guard the domain and the land of the buddhas of the Excellent Eon.

source: ཡུལ་འདིའི་མི་དང་བསྟན་པ་ཡང་སྲུང་བར་བྱེད་པར་འགྱུར་རོ། །
en: They will also guard the people and teachings in this land.

source: གཞན་ཡང་མ་འོངས་པའི་དུས་ན་ཡུལ་དགེ་བ་འདིའི་རྒྱལ་པོ་མཐུ་ཆུང་བར་འགྱུར་ཏེ།
en: “Moreover, in the future, the king of this land Virtue will grow weak, and

source: མཐུ་ཆུང་བ་དེས་ན་རང་གི་མཐུ་སྟོབས་ཀྱིས་ཡུལ་མི་ཐུབ་པས་
en: this infirmity will render him unable to rule the land independently. As a result,

source: རྒྱལ་པོ་དད་པ་ཅན་གཞན་འདི་ལྟ་སྟེ། བོད་ཀྱི་རྒྱལ་པོ་དང་། རྒྱའི་རྒྱལ་པོ་ལ་སོགས་པ་ལ་སྐྱབས་བཙལ་ནས་ཡུལ་སྲུང་བར་བྱེད་དོ། །
en: the king will seek protection from other faithful monarchs, such as the Tibetan and Chinese kings, and they will proceed to protect the land.

source: མ་འོངས་པའི་དུས་ན་རྒྱ་དང་བོད་ཀྱི་ཡུལ་དུ་དཀོན་མཆོག་གསུམ་གནས་ཤིང་མཆོད་གནས་ཆེན་པོར་བྱེད་པ་དང་།
en: Because in the future, the Three Jewels will be present and widely venerated in the lands of China and Tibet.

source: ཡུལ་དེ་དག་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་གནས་སུ་འགྱུར་ཞིང་།
en: Those lands will also become the abodes of bodhisattva great beings.

source: སེམས་ཅན་དེ་དག་ཀྱང་བྱང་ཆུབ་ཆེན་པོའི་ལམ་ཚོལ་བའི་ངང་ཚུལ་ཅན་ཐེག་པ་ཆེན་པོ་ལ་དད་པ།
en: The people in those lands will pursue the path of great awakening, have faith in the Great Vehicle, and

source: ཏིང་ངེ་འཛིན་ལ་གཞོལ་བར་འགྱུར་ཏེ
en: exert themselves in meditative absorption.

source: དེ་དག་གི་མཐུ་སྟོབས་ཀྱིས་ལི་ཡུལ་གྱི་མི་དང་། དཀོན་མཆོག་གསུམ་བརླག་པར་མི་འགྱུར་རོ། །
en: Through their power and might, the people of Khotan and the Three Jewels will not be destroyed.

source: སྐྱེས་བུ་དམ་པ་ཁྱེད་རྣམས་ཀྱིས་ཀྱང་བོད་དང་རྒྱའི་རྒྱལ་པོ་དང་བློན་པོ་དག་ཅི་ནས་ཀྱང་མཆོད་རྟེན་གོ་མ་ས་ལ་གན་ད་དང་། ཡུལ་དགེ་བ་འདི་ལ་རི་མོ་བྱེད་པར་འགྱུར་བ་དང་།
en: “All of you sublime beings, you must also by all means ensure that the kings and ministers of Tibet and China pay service to the Gomasalaganda stūpa and this land of Virtue.

source: ཡུལ་འདིར་བསོད་ནམས་བྱ་བའི་དངོས་པོ་དགེ་བ་རྒྱ་ཆེན་པོ་བྱེད་པར་འགྱུར་བ་དང་།
en: You must cause them to perform extensive virtue through meritorious acts.

source: ཡུལ་འདིའི་མི་ཉི་འོག་དད་པ་མེད་པའི་ཡུལ་གཞན་དུ་འཁྱམས་པ་རྣམས་ཀྱང་སྡུག་བསྔལ་དང་དབྲལ་ཞིང་བདེ་བར་རང་གི་ཡུལ་དུ་བསྐྱལ་ནས་ཕྱིར་
en: When people from this land travel to foreign border lands where people lack faith, you must relieve them of their suffering and ensure their easy return to their homeland. Thus,

source: ཡང་དག་པའི་ལྟ་བ་ཅན་དང་། བསོད་ནམས་ལ་དགའ་བར་འགྱུར་བར་སེམས་སྒྱུར་ཅིག་དང་།
en: you should transform their minds so they come to adopt the correct view and take delight in merit.

source: དགེ་བའི་རྩ་བ་དེའི་སྟོབས་ཀྱིས་སྐྱེས་བུ་དམ་པ་ཁྱེད་རྣམས་ཀྱི་དགེ་བའི་རྩ་བ་དང་། མདངས་དང་། གཟི་བརྗིད་དང་། འཁོར་འཕེལ་བར་འགྱུར་ཞིང་སངས་རྒྱས་ཉིད་དུ་ཡང་ཉེ་བར་འགྱུར་གྱིས།
en: Through the strength of these roots of virtue, sublime beings, your roots of virtue, and your luster, splendor, and retinues will increase and you will draw closer and closer to buddhahood.

source: དུས་གསུམ་དུ་གཏོགས་པའི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་གདམས་ངག་ལ་བྱས་པ་གཟོ་བར་གྱིས་ཤིག །
en: Repay the kindness of the instructions of the thus-gone ones of the three times!

source: འདི་ལྟར་ཡུལ་འདིའི་སེམས་ཅན་རྣམས་ནི་ཕྱིར་མི་ལྡོག་པ་བྱང་ཆུབ་སེམས་དཔའི་ལས་དང་ལྡན་པ།
en: In this way, the people of this land will adopt the bodhisattva deeds that make them irreversible.

source: སྙིང་རྗེ་དང་ལྡན་པ། བདེན་པ་དང་ལྡན་པ།
en: They will possess compassion and truth.

source: གཏོང་ཕོད་པ། ཕྲག་དོག་དང་འཁོན་དུ་འཛིན་པ་རྣམ་པར་སྤངས་པ།
en: They will be generous, free of jealousy and resentment,

source: བྱས་པ་གཟོ་བ། ཆོས་ལ་དགའ་བ། ཡང་དག་པའི་ལྟ་བ་ཅན། ལོག་པར་ལྟ་བ་ཐམས་ཅད་རྣམ་པར་སྤངས་པ། སེམས་འཇམ་པར་འགྱུར་ཏེ
en: have gratitude, delight in the Dharma, have the correct view, be free of all wrong views, and be gentle-minded.

source: རྒྱུ་དེས་ན་དགེ་བ་རྣམས་ཞེས་བྱའོ། །
en: Because of this they shall be called people from the land of Virtue.

source: ཡུལ་འདིའི་མཁར་ཡང་མི་བྱམས་པ་དང་འཇམ་པའི་སེམས་དང་ལྡན་པ་རྣམས་དང་།
en: Even the castle in this land will be filled with loving and gentle-minded people and

source: མཆོད་རྟེན་དང་གཙུག་ལག་ཁང་དུ་མས་བརྒྱན་པར་འགྱུར་ཏེ།
en: adorned with several stūpas and temples.

source: དེའི་ཕྱིར་མཁར་དགེ་བ་ཅན་ཞེས་བྱའོ། །
en: For that reason, the castle is called Virtuous Castle.

source: གཞན་ཡང་ཡུལ་གཞན་དག་ནས་སེམས་ཅན་དད་པ་མེད་པ་སྡང་བ་འཁོན་དུ་འཛིན་པ་དག་ཡུལ་འདིར་འོངས་པ་
en: “When faithless beings, hostile and antagonistic, come here from other lands,

source: ཀུན་ཡུལ་འདིའི་རྡུལ་གྱིས་རེག་ཅིང་། ཡུལ་འདི་ནས་འཁྲུངས་པའི་འཚོ་བ་ལ་ལོངས་སྤྱོད་ན་དེ་དག་ཐམས་ཅད་ཀྱིས་སེམས་བསྒྱུར་ནས་
en: their minds will be transformed simply by touching the sand in this region and by partaking of the food grown in this land.

source: སེམས་འཇམ་པ་དང་། མཉེན་པ་དང་། བྱམས་པའི་བསམ་པ་དང་། ཁྲོ་བ་དང་འཁོན་དུ་འཛིན་པ་སྤངས་པ་དང་། དད་པ་དང་། ཡང་ཡུལ་འདིའི་སྡིག་པ་མི་བྱེད་པར་འགྱུར་ཏེ
en: They will become gentle, mild, and loving, free of anger and resentment. They will develop faith and they will not perform misdeeds in this land.

source: ཡུལ་འདི་ནི་ཡོན་ཏན་མང་པོ་དེ་དག་དང་ལྡན་པ་ཡིན་ནོ། །
en: Such are the numerous qualities of this land.”

source: དེ་ནས་དེའི་ཚེ་སྔར་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱིས་ལན་གསུམ་གྱི་བར་དུ་བྱིན་གྱིས་བརླབས་ནས་
en: The Blessed Buddha, having previously blessed the land three times,

source: འོད་ཟེར་ཐུགས་རྗེ་ཆེན་པོ་དང་བཅས་ཏེ་བཀྱེ་བ་དེས་ཆུ་ན་གནས་པའི་སེམས་ཅན་རྣམས་ཀྱི་སེམས་ཡོངས་སུ་དག་པ་དང་།
en: now emitted light rays infused with great compassion, which purified the minds of all of the beings there who were living in the water and

source: བདེ་བ་དང་ལྡན་པར་བྱས་ནས་ཆུའི་ནང་ནས་སླར་འཐོན་ཏེ།
en: filled them with happiness. The light then re-emerged from the water and

source: ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་དུ་ཁྱབ་པར་གྱུར་ཏོ། །
en: spread out in all the buddha realms in the ten directions.

source: ཡང་འོད་ཟེར་དེ་དག་སླར་ལོག་ནས་
en: The light rays then returned and

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱིས་ཡུལ་བྱིན་གྱིས་བརླབས་པ་དང་། ཉན་ཐོས་ཆེན་པོ་རྣམས་ཀྱིས་ཡུལ་བྱིན་གྱིས་བརླབས་པ་དང་། མཚོའི་ནང་ནས་བྱུང་བའི་པད་མའི་སྟེང་ན་དེ་བཞིན་གཤེགས་པའི་གཟུགས་བརྙན་བཞུགས་པ་དེ་དང་དེ་དག་གི་འོད་ཟེར་དང་འདྲེས་ནས་
en: merged with the light rays of the places blessed by the bodhisattva great beings, the light rays of the places blessed by the great hearers, and the light rays of the images of the thus-gone ones seated upon the lotuses that had emerged upon the lake.

source: ནམ་མཁའ་ལ་འཕགས་ཏེ་སྟེང་གི་ནམ་མཁའ་ཁེབས་པར་གྱུར་ཅིང་
en: At that point, the rays exploded upward into the atmosphere, covering the sky above, and

source: ལི་ཡུལ་ཐམས་ཅད་དུ་ལྷའི་མེ་ཏོག་གི་ཆར་ཕབ་བོ།
en: a rain of divine flowers showered down upon the entire land of Khotan.

source: ལྷའི་མེ་ཏོག་དེ་དག་ཕན་ཚུན་དུ་རེག་པ་ལས་
en: As these divine flowers touched one another,

source: ཆོས་ཀྱི་སྒོ་མོ་འདི་ལྟ་སྟེ། སངས་རྒྱས་དང་། ཆོས་དང་། དགེ་འདུན་གྱི་མཚན་དང་། ཡང་དག་པའི་ལྟ་བ་དང་། ཤེས་རབ་དང་། ཚུལ་ཁྲིམས་དང་། དགེ་བའི་རྩ་བ་དང་། དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་དཀའ་བ་སྤྱད་པ་དང་། སྨོན་ལམ་དང་། བྱང་ཆུབ་སེམས་དཔའི་རྫུ་འཕྲུལ་དང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་དང་། དགེ་སྦྱོང་གི་འབྲས་བུ་བཞི་པོ་རྒྱུན་དུ་ཞུགས་པ་དང་། ལན་ཅིག་ཕྱིར་འོང་བ་དང་། ཕྱིར་མི་འོང་བ་དང་། དགྲ་བཅོམ་པ་དང་། ཁམས་གསུམ་གྱི་སྲིད་པ་ལས་ངེས་པར་འབྱིན་པ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་དང་། འདུ་བྱེད་འཇིག་པ་དང་། དྲན་པ་ཉེ་བར་གཞག་པ་དང་། འཕགས་པའི་བདེན་པ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། བསམ་གཏན་དང་། བསྡུ་བའི་དངོས་པོ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་། དབང་པོ་ཡོངས་སུ་དག་པ་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་དང་འཐུན་པའི་ཆོས་མཐའ་དག་གི་སྒྲ་འབྱིན་པར་གྱུར་ཏོ། །
en: sounds of the following gateways of Dharma rang out: the names of Buddha, Dharma, and Saṅgha; the correct view; insight; discipline; roots of virtue; the austerities performed by the thus-gone ones; their aspirations; the bodhisattvas’ miraculous feats and the ways they ripen sentient beings; the four results of spiritual practitioners: stream enterer, once-returner, non-returner, and worthy one; escape from the existences of the three realms; the three gateways of liberation; destruction of the karmic formations; the applications of mindfulness; the truths of noble ones; the bases of miraculous absorption; concentration; the means of attracting disciples; correct discrimination; the four formless attainments; the purity of the faculties; and all the teachings that are in accord with the factors of awakening.
